app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `fb_user_id`, `email_hash`, `remember_token`, `login`, `email`, `created_at`) VALUES('Yogesh', '6aefce124f712b76bf045a41743278e303628345', '2010-05-14 20:22:22', 'e45d1192c56a4145656f29850e43aef6639619ea', NULL, NULL, NULL, NULL, 'yogeshkumarverma@gmail.com', 'yogeshkumarverma@gmail.com', '2010-05-14 20:22:22')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save